src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/РасходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиТоваров Расход
		
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Если ТекСтрокаТовары.Номенклатура.ЭтоУслуга = Истина  Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	
	Движения.Записать();
	
	Если Режим = РежимПроведенияДокумента.Оперативный  Тогда 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиТоваровОстатки.Склад КАК Склад,
			|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
			|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	МИНИМУМ(РасходнаяНакладнаяТовары.НомерСтроки) КАК НомерСтроки
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваров.Остатки(, Склад В
			|		(ВЫБРАТЬ
			|			РасходнаяНакладная.Склад КАК Склад
			|		ИЗ
			|			Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|		ГДЕ
			|			РасходнаяНакладная.Ссылка = &Ссылка)) КАК ОстаткиТоваровОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
			|		ПО ОстаткиТоваровОстатки.Номенклатура = РасходнаяНакладнаяТовары.Номенклатура
			|		И РасходнаяНакладнаяТовары.Ссылка = &Ссылка
			|ГДЕ
			|	ОстаткиТоваровОстатки.КоличествоОстаток < 0
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиТоваровОстатки.Склад,
			|	ОстаткиТоваровОстатки.Номенклатура,
			|	ОстаткиТоваровОстатки.КоличествоОстаток";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			
			Отказ = Истина;
		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "По номенклатуре " + ВыборкаДетальныеЗаписи.Номенклатура + " образовался отрицательный остаток: " + ВыборкаДетальныеЗаписи.КоличествоОстаток;
				Сообщение.Поле =  "Товары["+ (ВыборкаДетальныеЗаписи.НомерСтроки-1) +"].Количество";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();         
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
